<?xml version="1.0" ?>
<net batch="1" name="Dehaze_fullconv" version="4">
	<layers>
		<layer id="0" name="data" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="convQ" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="16" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="2400"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="2" name="ReLU0" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="convA1" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2432" size="4608"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="4" name="convA2" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="16" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7040" size="12800"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="5" name="convA3" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="16" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="19840" size="25088"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="6" name="convA" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="relu1" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="convB1" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="44928" size="13824"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="9" name="convB11" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="16" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="58752" size="12800"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="10" name="convB2" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="16" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="71552" size="38400"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="11" name="convB21" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="16" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="109952" size="25088"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="12" name="elem_1" precision="FP16" type="Eltwise">
			<data coeff="" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="convB" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="16" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="135040" size="12800"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="14" name="convC" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="convC1" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>398</dim>
					<dim>598</dim>
				</port>
			</output>
			<blobs>
				<weights offset="147840" size="25600"/>
				<biases offset="2400" size="32"/>
			</blobs>
		</layer>
		<layer id="16" name="pool1" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="7,7" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>398</dim>
					<dim>598</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>392</dim>
					<dim>592</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="convD" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="1" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>392</dim>
					<dim>592</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>390</dim>
					<dim>590</dim>
				</port>
			</output>
			<blobs>
				<weights offset="173440" size="1568"/>
				<biases offset="175008" size="2"/>
			</blobs>
		</layer>
		<layer id="18" name="drelu1" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>390</dim>
					<dim>590</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>390</dim>
					<dim>590</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="4" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="4" from-port="3" to-layer="6" to-port="1"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="2"/>
		<edge from-layer="6" from-port="3" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="3" to-layer="11" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="1.5.12.49d067a0"/>
		<cli_parameters>
			<data_type value="FP16"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<extensions value="DIR"/>
			<framework value="caffe"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR/solver-new128_iter_10000.caffemodel"/>
			<input_proto value="DIR/DehazeFCN-new128.prototxt"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<log_level value="ERROR"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input, input_shape, mean_file, mean_file_offsets, model_name, output, scale"/>
		</cli_parameters>
	</meta_data>
</net>
